In [255]:
import pandas as pd
import numpy as np
import re

In [2]:
data = pd.read_csv('titanic.csv', index_col='PassengerId')

In [59]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data['Pclass'].value_counts().reset_index()

   index  Pclass
0      3     491
1      1     216
2      2     184

In [138]:
def write_ans(filename='output.txt', *args):
    with open(filename, 'w') as f:
        f.write(' '.join(str(s) for s in args) + ' ')

### Какое количество мужчин и женщин ехало на корабле? В качестве ответа приведите два числа через пробел.

In [139]:
print(len(data.Sex[data['Sex'] == 'male']), len(data.Sex[data['Sex'] == 'female']), sep=',')

577,314

In [140]:
data['Sex'].value_counts().reset_index()

    index  Sex
0    male  577
1  female  314

In [142]:
write_ans('task1.txt', len(data.Sex[data['Sex'] == 'male']), len(data.Sex[data['Sex'] == 'female']))

### Какой части пассажиров удалось выжить? Посчитайте долю выживших пассажиров. Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [36]:
print(round(100.0 * data['Survived'].mean(), 2))

38.38

In [143]:
write_ans('task2.txt', round(100.0 * data['Survived'].mean(), 2))

### Какую долю пассажиры первого класса составляли среди всех пассажиров? Ответ приведите в процентах (число в интервале от 0 до 100, знак процента не нужен), округлив до двух знаков.

In [47]:
print(round(100 * len(data[data['Pclass'] == 1]) / len(data['Pclass']), 2) )

24.24

In [144]:
write_ans('task3.txt', round(100 * len(data[data['Pclass'] == 1]) / len(data['Pclass']), 2))

### Какого возраста были пассажиры? Посчитайте среднее и медиану возраста пассажиров. В качестве ответа приведите два числа через пробел.

In [49]:
data['Age'].mean(), data['Age'].median()

(29.69911764705882, 28.0)

In [151]:
write_ans('task4.txt', data['Age'].mean(), data['Age'].median())

### Коррелируют ли число братьев/сестер/супругов с числом родителей/детей? Посчитайте корреляцию Пирсона между признаками SibSp и Parch.

In [149]:
data[['SibSp', 'Parch']].corr(method='pearson').iloc[0][1]

0.41483769862015263

In [152]:
write_ans('task5.txt', data[['SibSp', 'Parch']].corr(method='pearson').iloc[0][1])

### Какое самое популярное женское имя на корабле? Извлеките из полного имени пассажира (колонка Name) его личное имя (First Name). Это задание — типичный пример того, с чем сталкивается специалист по анализу данных. Данные очень разнородные и шумные, но из них требуется извлечь необходимую информацию. Попробуйте вручную разобрать несколько значений столбца Name и выработать правило для извлечения имен, а также разделения их на женские и мужские.

In [256]:
def clean_name(name):
 
    # Первое слово до запятой - фамилия
    s = re.search('^[^,]+, (.*)', name)
    if s:
        name = s.group(1)
 
    # Если есть скобки - то имя пассажира в них
    s = re.search('\(([^)]+)\)', name)
    if s:
        name = s.group(1)
    # Удаляем обращения
    name = re.sub('(Miss\. |Mrs\. |Ms\. )', '', name)
    # Берем первое оставшееся слово и удаляем кавычки
    name = name.split(' ')[0].replace('"', '')
    return name
 
names = data[data['Sex'] == 'female']['Name'].map(clean_name)
name_counts = names.value_counts()
 
print(6, name_counts.head(1).index.values[0])

6 Anna

In [259]:
answer = name_counts.head(1).index.values[0]
answer

'Anna'

In [260]:
write_ans('task6.txt', answer)